// rust程序入口函数，和其他的语言一样，都是 main，该函数目前没有返回值
fn main(){
    // 用let声明变量，进行绑定，a是不可变的
    // 此处没有指定a的类型，编译器会根据a的值为a推断类型 i32 有符号32位的整数
    let a = 10;
    //主动指定b的类型为 i32 (上面a那个为什么会有i32呢，因为vscode插件自己帮我们干了
    let b: i32 = 20;
    // 可以在数值中带上类型，30i32表示数值为30，类型为i32
    // c是可变的， mut是mutable的缩写
    let mut c = 30i32;
    // 还能在数值和类型中间添加一个下划线增强可读性
    let d = 30_i32;
    //跟其它语言一样，可以使用 函数的返回值作为另外一个函数的参数;
    let e = add(add(a,b),add(c,d));
    println!("(a+b) + (c+d) = {}", e);
}
// 这个地方不能加 ; 会导致改变语法导致函数返回 () 而不是 i32
fn add(i:i32, j:i32) -> i32 {
    return i + j
}